import { EventItem } from "../types/timeline";

export const events: EventItem[] = [
  {
    id: "e1",
    year: 1980,
    description: "Sinclair Research выпускает домашний компьютер ZX80",
    label: "Технологии",
  },
  {
    id: "e2",
    year: 1982,
    description:
      "Появился домашний компьютер ZX\u00A0Spectrum, выпущенный британской компанией Sinclair Research",
    label: "Технологии",
  },
  {
    id: "e27",
    year: 1983,
    description:
      "Microsoft анонсирует Word for\u00A0MS-DOS\u00A0— раннюю версию текстового процессора",
    label: "Технологии",
  },
  {
    id: "e28",
    year: 1984,
    description:
      "Apple выпускает компьютер Macintosh 128K с графическим интерфейсом и мышью",
    label: "Технологии",
  },
  {
    id: "e29",
    year: 1985,
    description:
      "Nintendo выпускает игровую консоль Nintendo Entertainment System (NES) в Японии",
    label: "Технологии",
  },
  {
    id: "e30",
    year: 1986,
    description:
      "Intel представляет микропроцессор i386, первый 32-битный для ПК",
    label: "Технологии",
  },
  {
    id: "e3",
    year: 1987,
    description: "«Хищник»\u00A0/ Predator, США (реж. Джон Мактирнан)",
    label: "Кино",
  },
  {
    id: "e4",
    year: 1988,
    description:
      "«Кто подставил кролика Роджера»\u00A0/ Who Framed Roger Rabbit, США (реж. Роберт Земекис)",
    label: "Кино",
  },
  {
    id: "e31",
    year: 1988,
    description:
      "Вышел фильм «Бэтмен»\u00A0/ Batman (США, реж. Тим Бёртон) с\u00A0Майклом Китоном в\u00A0главной роли",
    label: "Кино",
  },
  {
    id: "e5",
    year: 1989,
    description:
      "«Назад в\u00A0будущее\u00A02»\u00A0/ Back To\u00A0The Future\u00A02, США (реж. Роберт Земекис)",
    label: "Кино",
  },
  {
    id: "e32",
    year: 1989,
    description:
      "Премьера анимационного фильма «Русалочка»\u00A0/ The\u00A0Little Mermaid от\u00A0Disney",
    label: "Кино",
  },
  {
    id: "e33",
    year: 1990,
    description:
      "Фильм «Твин Пикс: Огненный лес»\u00A0/ Twin Peaks: Fire Walk with\u00A0Me (США, реж. Дэвид Линч)",
    label: "Кино",
  },
  {
    id: "e6",
    year: 1990,
    description:
      "«Крепкий орешек\u00A022»\u00A0/ Die Hard\u00A02, США (реж. Ренни Харлин)",
    label: "Кино",
  },
  {
    id: "e7",
    year: 1991,
    description:
      "«Семейка Аддамс»\u00A0/ The Addams Family, США, (реж. Барри Зонненфельд)",
    label: "Кино",
  },
  {
    id: "e34",
    year: 1991,
    description:
      "Вышел культовый фильм «Терминатор\u00A02: Судный день»\u00A0/ Terminator\u00A02: Judgment Day (США, реж. Джеймс Кэмерон)",
    label: "Кино",
  },
  {
    id: "e8",
    year: 1992,
    description:
      "Нобелевская премия по\u00A0литературе\u00A0— Дерек Уолкотт, «За\u00A0блестящий образец карибского эпоса в\u00A064\u00A0разделах»",
    label: "Литература",
  },
  {
    id: "e9",
    year: 1994,
    description: "«Бессонница», роман Стивена Кинга",
    label: "Литература",
  },
  {
    id: "e10",
    year: 1995,
    description: "Нобелевская премия по\u00A0литературе\u00A0— Шеймас Хини",
    label: "Литература",
  },
  {
    id: "e36",
    year: 1995,
    description:
      "Анна Гавальда публикует повесть-притчу «35по\u00A0кило надежды»",
    label: "Литература",
  },
  {
    id: "e11",
    year: 1997,
    description:
      "«Гарри Поттер и\u00A0философский камень», роман Джоан Роулинг",
    label: "Литература",
  },
  {
    id: "e35",
    year: 1997,
    description:
      "Нобелевская премия по\u00A0литературе присуждена Дариопо\u00A0Фо запо\u00A0его комедийные и\u00A0политические произведения",
    label: "Литература",
  },
  {
    id: "e12",
    year: 1999,
    description:
      "Премьера балета «Золушка» в\u00A0постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона",
    label: "Культура",
  },
  {
    id: "e13",
    year: 2000,
    description: "Возобновлено издание журнала «Театр»",
    label: "Культура",
  },
  {
    id: "e14",
    year: 2002,
    description:
      "Премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный Театр, Лондон",
    label: "Культура",
  },
  {
    id: "e37",
    year: 2002,
    description:
      "В\u00A0Москве открывается Театр наций, предлагающий экспериментальные постановки, объединяющий творчество и\u00A0благотворительность",
    label: "Культура",
  },
  {
    id: "e15",
    year: 2003,
    description:
      "В Венеции восстановлен оперный театр Ла Фениче, полностью сгоревший при пожаре 1996 года",
    label: "Культура",
  },
  {
    id: "e16",
    year: 2006,
    description:
      "Баскетбольный клуб ЦСКА стал победителем национального первенства России",
    label: "Спорт",
  },
  {
    id: "e17",
    year: 2008,
    description:
      "С\u00A08\u00A0по\u00A024\u00A0августа в\u00A0Пекине прошли 29-е летние Олимпийские игры",
    label: "Спорт",
  },
  {
    id: "e18",
    year: 2010,
    description:
      "13–28 февраля в\u00A0Ванкувере: зимние Олимпийские игры 2010 года",
    label: "Спорт",
  },
  {
    id: "e19",
    year: 2012,
    description: "2\u00A0августа\u00A0— летние Олимпийские игры в\u00A0Лондоне",
    label: "Спорт",
  },
  {
    id: "e20",
    year: 2014,
    description: "XXII зимние Олимпийские игры (Сочи, Россия)",
    label: "Спорт",
  },
  {
    id: "e21",
    year: 2015,
    description:
      "13\u00A0сентября\u00A0— частное солнечное затмение, видимое в\u00A0Южной Африке и\u00A0части Антарктиды",
    label: "Наука",
  },
  {
    id: "e22",
    year: 2016,
    description:
      "Телескоп «Хаббл» обнаружил самую удалённую из\u00A0всех обнаруженных галактик, получивую обозначение GN-z11",
    label: "Наука",
  },
  {
    id: "e38",
    year: 2016,
    description:
      "Обнаружение гравитационных волн коллаборацией LIGO\u00A0– подтверждение одного из\u00A0ключевых предсказаний Эйнштейна и\u00A0новый виток в\u00A0астрофизике",
    label: "Наука",
  },
  {
    id: "e23",
    year: 2017,
    description:
      "Компания Tesla официально представила первый в\u00A0мире электрический грузовик Tesla Semi",
    label: "Наука",
  },
  {
    id: "e24",
    year: 2018,
    description:
      "Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца",
    label: "Наука",
  },
  {
    id: "e25",
    year: 2019,
    description:
      "Google объявил о\u00A0создании 53-кубитного квантового компьютера",
    label: "Наука",
  },
  {
    id: "e26",
    year: 2020,
    description:
      "Корабль Crew Dragon вернулся на\u00A0Землю из\u00A0первого пилотируемого полёта",
    label: "Наука",
  },
];
